Revit 2027 API
View3D.RestoreOrientationAndLock Method
 Locks the view and restores its orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RestoreOrientationAndLock()
Public Sub RestoreOrientationAndLock
public:
void RestoreOrientationAndLock()
member RestoreOrientationAndLock : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  View has never been locked.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace